ALCO = {
    "виски": [
        "Комнатной температуры или со льдом в бокале tumbler; комнатной температуры в бокале dram, сопровождаемое дополнительным бокалом или графином с водой", "С водой; С содовой; С колой", ["God Father", "Irish Coffee", "Manhattan", "Dry Manhattan", "Perfect Manhattan", "Old Fashioned", "Rob Roy, Rusty Nail", "Whiskey Sour"],
    ],
    "коньяк": [
        "Комнатной температуры в коньячном бокале на диджестив; со льдом в бокале tumbler на аперетив", "С содовой; С водой; С тоником", ["Side Car", "French Connection"]
    ],
    "арманьяк": [
        "Комнатной температуры в арманьячном бокале на диджестив; со льдом в бокале tumbler на аперитив", "С содовой; С водой; С тоником; С шампанским; С кофе", ""
    ],
    "бренди": [
        "Со льдом в бокале tumbler на аперитив; комнатной температуры в коньячном бокале на диджестив (для высококачественных бренди)", "С тоником; С содовой; С апельсиновым соком", ["Alexsander", "Brandy Egg-Nog", "Champange Coctail", "Horse's Neck", "Porto Flip", "Stinger"]
    ],
    "кальвадос": [
        "Комнатной температуры в коньячном бокале на диджестив; в середине ужина в стопке ( trou Normand ); со льдом в бокале tumbler на аперитив", "С содовой; С апельсиновым соком; С кофе", ""
    ],
    "можжевеловый": [
        "Охлажденным в стопке или со льдом в бокале tumbler", "С тоником; С вермутом; С лимонным соком", ["Bronx", "Gibson", "Gin and French", "Gin and It", "Gin Fizz", "Jhon Colins", "Dry Martini", "Perfect Martini", "Negroni", "Paradise", "Singapore Sling", "White Lady"]
    ],
    "джин": [
        "Охлажденным в стопке или со льдом в бокале tumbler", "С тоником; С вермутом; С лимонным соком", ["Bronx", "Gibson", "Gin and French", "Gin and It", "Gin Fizz", "Jhon Colins", "Dry Martini", "Perfect Martini", "Negroni", "Paradise", "Singapore Sling", "White Lady"]
    ],
    "мескаль": [
        "Охлажденные, в стопке, с солью и ломтиком лимона или лайма", "С тоником; С лимонным соком; С апельсиновым соком", ["Margarita", "Teqilla Sunrise"]
    ],
    "текила": [
        "Охлажденные, в стопке, с солью и ломтиком лимона или лайма", "С тоником; С лимонным соком; С апельсиновым соком", ["Margarita", "Teqilla Sunrise"]
    ],
    "ром": [
        "Выдержанный ром комнатной температуры в коньячном бокале на диджестив", "С колой; С соками", ["Bacardi Coctail", "Banana Daiquiri", "Daiquiri", "Pina Colada", "Planter's Punch"]
    ],
    "водка": [
        "Сильно охлажденная (-10 С) в стопке может сопровождать целый ужин", "С тоником; С соками; С вермутом", ["Black Russian", "Blooby Mary", "Bullshot", "God Mother", "Harvey Wallbanger", "Screwdiver", "Vodka Martini", "White Russian"]
    ],
    "марк": [
        "Комнатной температуры в стопке на диджестив", "", ""
    ],
    "граппа": [
        "Комнатной температуры в стопке на диджестив", "", ""
    ],
    "кирш": [
        "В стопке на диджестив или в середине ужина", "С вермутом; С соками", ["Rose"]
    ],
    "вино": [
        "Белое вино подаётся температуры 6-12 градусов. Красное при 13-17 градусах. Чем насыщеннее и многослойнее вкус вина, тем теплее оно должно быть и тем более простые блюда должны его сопровождать."
        "Сладкое, десерты, сыры хорошо сочетаются со сладкими винами. Сухие вина хорошо сочетаются с мясными блюдами.", "", []
    ],
    "абсент": [
        "Абсент представляет собой классический аперитив. Перед подачей следует остудить до температуры в 0 градусов. Пить залпом из стопки, не более 30 грамм за раз.", "", []
    ]
}

DICTIONARY = {
    ("лонг",) : ("Алкогольный коктейль достаточно большого объёма (более 120 мл, средний объём — 160—400 мл). Обычно готовится с большим количеством льда, поэтому пьётся долго, по мере его таяния, через трубочку. Хорошо освежает в жаркие дни.",),
    ("аперитив",) : ("Чаще всего слабоалкогольный напиток, подаваемый перед едой для возбуждения аппетита",),
    ("дижестив",) : ("Общее название напитков, которые подают после еды. Считается, что дижестив помогает перевариванию пищи.",),
    ("дэш", "дешь", "дэшь", "деш"): ("Порция от 0.2 до 1.5 миллилитров",),
    ("мадл", "мадел", "мадэл"): ("Разминание, раздавливание содержимого",),
    ("билдинг", "билд", "билт"): ("Последовательное наливание ингридиентов",),
    ("шейк", "шейкинг", "шэйк", "шэйкинг"): ("Все ингредиенты со льдом добавляются в плотно закрывающуюся тару (шейкер) и встряхиваются. Напиток одновременно охлаждается, разбавляется и насыщается воздухом.",),
    ("стрэйн", "стрейн"): ("Фильтрация от льда, кусочков ягод и фруктов.",),
    ("бленд", "блэнд"): ("Смешивание в механическом блендере",),
    ("стер", "стир", "стиринг"): ("Перемешивание ингридиентов барной ложкой в смесительном стакане",),
    ("битер", "биттер", "биттэр", "биттер", "биттереть"): ("Крепкие алкогольные напитки, отличающиеся горьким вкусом. К биттерам относят горькие настойки (горькие бальзамы), а также некоторые виды вермутов и ликеров.",),
    ("бурбон", ): ("Вид виски, производимый в США из кукурузы и обладающий золотистым цветом и долгим послевкусием.",),
    ("кальвадос", "кальводос"): ("Яблочный или грушевый бренди, получаемый путём перегонки сидра, из французского региона Нижняя Нормандия. Крепость — около 40%",),
    ("бренди", ): ("Крепкий алкогольный напиток, общий термин для обозначения продуктов дистилляции виноградного вина, фруктовой или ягодной браги (обычно крепостью 40—60%). Если явно не указано иное, то бренди изготавливается из виноградного вина.",),
    ("коньяк", ): ("Крепкий алкогольный напиток (разновидность бренди), производимый из определённых сортов винограда по особой технологии в регионе Шаранта, Франция. В частности в городе Коньяк.",),
    ("виски", "висок"): ("Крепкий ароматный алкогольный напиток, получаемый из различных видов зерна с использованием процессов соложения, брожения, перегонки и длительного выдерживания в дубовых бочках. При изготовлении виски может использоваться ячмень, рожь, пшеница или кукуруза. В Бретани также делают виски из гречихи. Содержание спирта — обычно 32—60%.",),
    ("джина", "джин"): ("Крепкий (не менее 37,5 %) алкогольный напиток, получаемый путем перегонки зернового спирта с добавлением пряностей.",),
    ("кюрасао", ): ("Ароматный ликёр, вырабатываемый из винного спирта с добавлением высушенной апельсиновой корки, мускатного ореха, гвоздики и корицы. Может быть оранжевым, голубым, зеленоватым либо бесцветным.",),
    (("трипл", "сек"), ("triple", "sec"), ('сечь', 'триплый')): ("ликёр с ароматом апельсина, похож на ликёр Кюрасао, но менее сладкий и не имеет цвета. Содержание алкоголя — 15-40%, плотность — 1,09.",),
    ("водка", ): ("Крепкий алкогольный напиток, бесцветный водно-спиртовой раствор с характерным вкусом и спиртовым запахом.",),
    ("ром", ): ("Крепкий спиртной напиток, изготавливаемый путём сбраживания и перегонки патоки или тростникового сиропа.",),
    (("шампанский", "бокал"),): ("", "1652229/bf8faa119cf0dca2f126"),
    (("шампанский", "-бокал"), ): ("Игристое вино, произведённое во французском регионе Шампань из установленных сортов винограда методом вторичного брожения вина в бутылке.",),
    ("текила", "текилла", "тэкилла", "тэкила"): ("Крепкий алкогольный напиток, изготавливаемый из сока голубой агавы строго на территории 5 штатов Мексики: Халиско, Гуанахуато, Мичоакан, Наярит и Тамаулипас.",),
    ("абсент", ): ("Крепкий алкогольный напиток (45-86 градусов), светло-зеленого или зеленовато-желтого цвета. Содержит в составе зеленый анис, фенхель и горькую полынь.",),
    ("олд", "фэшен", "фешен", "фэйшен", "фейшен", "фейшенед", "фэйшенед", "фэшенед"): ("","213044/390efa8c2180c983993c"),
    ("хайболл", "хайбл", "хайбол", "хойбол", "хойболл"): ("","1030494/03cf91f0657720e9ab11"),
    ("мартини", "коктейльная"): ("","213044/cd515a1c8a1cd02df2f1"),
    ("драм", "дрэм", "дрим", "драмм", "дремм", "драма"): ("","965417/2562e6d20a6134365804"),
}